app/Controllers/User.php

    public function qrcodegenath()
    {
        $email_id = session()->get('email_id');
        // echo "<pre>"; print_r($email_id); die();
        if(isset($email_id) && $email_id != NULL)
        {

            $data = $this->user->where('email_id', $email_id)->where('is_active', 1)->first();
            // echo "<Pre>"; print_r($data); die();
            if($data)
            {

                    $id = $data['id'];
                    $update_data['is_active'] = "0";
                    $data_updated = $this->user->update($id,$update_data);
---
SELECT *
FROM `user`
WHERE `email_id` = 'Abc@gmail.com'
AND `is_active` = 1
 LIMIT 1
UPDATE `user` SET `is_active` = '0'
WHERE `user`.`id` IN ('1')

    public function dashboard()
    {
        // echo "test"; die();
        $user_id = session()->get('id');
        $user_details = $this->user->where('id',$user_id)->first();
---
SELECT *
FROM `user`
WHERE `id` = '1'
 LIMIT 1

    public function userlist()
    {
        $user_id = session()->get('id');
        $user_details = $this->user->where('id',$user_id)->first();
---
SELECT *
FROM `user`
WHERE `id` = '1'
 LIMIT 1

    public function userlistath()
    {
        $params['draw'] = $this->request->getVar('draw');
        $start = $this->request->getVar('start');
        $length = $this->request->getVar('length');
        $user_data = $this->user->orderBy('id', 'DESC')->findAll();
---
SELECT *
FROM `user`
ORDER BY `id` DESC